In [19]:
import pandas as pd

In [20]:
dados1 = {
    'ID': [1, 2, 3, 4],
    'Nome': ['Ana', 'Pedro ', 'Maria', 'João'],
    'Setores': ['RH', 'Vendas', 'Administrativo','Produção'],
    
}

dados2 = {
    'ID': [1, 2, 3, 4],
    'Salários': [3000,2800,3200,2500]
    
}
Label = [1,2,3,4]

In [21]:
df1 = pd.DataFrame(dados1)
df2 = pd.DataFrame(dados2)

In [22]:
pd.merge(df1,df2,how='inner')

   ID    Nome         Setores  Salários
0   1     Ana              RH      3000
1   2  Pedro           Vendas      2800
2   3   Maria  Administrativo      3200
3   4    João        Produção      2500